{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "UnicodeScripts"
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<UNK>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<PAD>": 0,
      "<UNK>": 1,
      " ": 2,
      "\"": 3,
      "(": 4,
      ")": 5,
      "*": 6,
      "+": 7,
      ",": 8,
      "-": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      ":": 21,
      ";": 22,
      "A": 23,
      "B": 24,
      "C": 25,
      "E": 26,
      "I": 27,
      "K": 28,
      "L": 29,
      "N": 30,
      "S": 31,
      "T": 32,
      "U": 33,
      "W": 34,
      "Y": 35,
      "[": 36,
      "]": 37,
      "a": 38,
      "c": 39,
      "d": 40,
      "e": 41,
      "h": 42,
      "i": 43,
      "n": 44,
      "o": 45,
      "q": 46,
      "r": 47,
      "s": 48,
      "t": 49,
      "u": 50,
      "w": 51,
      "x": 52,
      "y": 53,
      "×": 54,
      "ü": 55,
      "—": 56,
      "“": 57,
      "”": 58,
      "→": 59,
      "、": 60,
      "。": 61,
      "一": 62,
      "七": 63,
      "三": 64,
      "上": 65,
      "下": 66,
      "不": 67,
      "与": 68,
      "专": 69,
      "且": 70,
      "东": 71,
      "两": 72,
      "个": 73,
      "中": 74,
      "串": 75,
      "临": 76,
      "为": 77,
      "主": 78,
      "义": 79,
      "之": 80,
      "九": 81,
      "也": 82,
      "书": 83,
      "了": 84,
      "事": 85,
      "二": 86,
      "于": 87,
      "互": 88,
      "五": 89,
      "井": 90,
      "些": 91,
      "交": 92,
      "亦": 93,
      "产": 94,
      "享": 95,
      "人": 96,
      "仅": 97,
      "介": 98,
      "仍": 99,
      "从": 100,
      "他": 101,
      "代": 102,
      "以": 103,
      "们": 104,
      "件": 105,
      "任": 106,
      "休": 107,
      "传": 108,
      "伸": 109,
      "似": 110,
      "但": 111,
      "位": 112,
      "低": 113,
      "住": 114,
      "体": 115,
      "何": 116,
      "余": 117,
      "作": 118,
      "佣": 119,
      "使": 120,
      "例": 121,
      "供": 122,
      "依": 123,
      "侧": 124,
      "便": 125,
      "保": 126,
      "信": 127,
      "倒": 128,
      "借": 129,
      "值": 130,
      "偏": 131,
      "側": 132,
      "储": 133,
      "像": 134,
      "儿": 135,
      "元": 136,
      "充": 137,
      "入": 138,
      "全": 139,
      "八": 140,
      "公": 141,
      "六": 142,
      "共": 143,
      "关": 144,
      "其": 145,
      "具": 146,
      "兼": 147,
      "内": 148,
      "再": 149,
      "冗": 150,
      "决": 151,
      "况": 152,
      "准": 153,
      "减": 154,
      "凑": 155,
      "几": 156,
      "凸": 157,
      "出": 158,
      "分": 159,
      "划": 160,
      "列": 161,
      "则": 162,
      "初": 163,
      "判": 164,
      "利": 165,
      "别": 166,
      "到": 167,
      "制": 168,
      "刻": 169,
      "前": 170,
      "剩": 171,
      "割": 172,
      "功": 173,
      "加": 174,
      "务": 175,
      "动": 176,
      "助": 177,
      "势": 178,
      "勤": 179,
      "匀": 180,
      "包": 181,
      "化": 182,
      "北": 183,
      "区": 184,
      "十": 185,
      "升": 186,
      "半": 187,
      "单": 188,
      "南": 189,
      "占": 190,
      "卡": 191,
      "卧": 192,
      "卫": 193,
      "即": 194,
      "厅": 195,
      "压": 196,
      "厕": 197,
      "厨": 198,
      "去": 199,
      "参": 200,
      "又": 201,
      "叉": 202,
      "及": 203,
      "双": 204,
      "发": 205,
      "叠": 206,
      "口": 207,
      "另": 208,
      "只": 209,
      "可": 210,
      "台": 211,
      "右": 212,
      "号": 213,
      "各": 214,
      "合": 215,
      "同": 216,
      "名": 217,
      "后": 218,
      "向": 219,
      "吧": 220,
      "含": 221,
      "启": 222,
      "呈": 223,
      "周": 224,
      "呼": 225,
      "和": 226,
      "品": 227,
      "响": 228,
      "唯": 229,
      "四": 230,
      "回": 231,
      "因": 232,
      "团": 233,
      "围": 234,
      "固": 235,
      "图": 236,
      "在": 237,
      "地": 238,
      "场": 239,
      "均": 240,
      "坐": 241,
      "块": 242,
      "垂": 243,
      "型": 244,
      "域": 245,
      "基": 246,
      "堂": 247,
      "堆": 248,
      "堵": 249,
      "填": 250,
      "境": 251,
      "墙": 252,
      "壁": 253,
      "壤": 254,
      "处": 255,
      "备": 256,
      "复": 257,
      "外": 258,
      "多": 259,
      "大": 260,
      "天": 261,
      "央": 262,
      "头": 263,
      "夹": 264,
      "套": 265,
      "好": 266,
      "如": 267,
      "始": 268,
      "子": 269,
      "字": 270,
      "存": 271,
      "孤": 272,
      "它": 273,
      "宅": 274,
      "安": 275,
      "完": 276,
      "定": 277,
      "实": 278,
      "客": 279,
      "室": 280,
      "家": 281,
      "宽": 282,
      "密": 283,
      "寓": 284,
      "寸": 285,
      "对": 286,
      "导": 287,
      "封": 288,
      "射": 289,
      "将": 290,
      "小": 291,
      "少": 292,
      "尤": 293,
      "就": 294,
      "尺": 295,
      "尽": 296,
      "尾": 297,
      "局": 298,
      "层": 299,
      "居": 300,
      "屋": 301,
      "展": 302,
      "属": 303,
      "岔": 304,
      "嵌": 305,
      "工": 306,
      "左": 307,
      "己": 308,
      "已": 309,
      "布": 310,
      "带": 311,
      "常": 312,
      "帽": 313,
      "干": 314,
      "平": 315,
      "并": 316,
      "广": 317,
      "床": 318,
      "序": 319,
      "库": 320,
      "应": 321,
      "底": 322,
      "度": 323,
      "座": 324,
      "庭": 325,
      "廊": 326,
      "廓": 327,
      "延": 328,
      "建": 329,
      "开": 330,
      "异": 331,
      "式": 332,
      "引": 333,
      "张": 334,
      "弧": 335,
      "弹": 336,
      "强": 337,
      "归": 338,
      "当": 339,
      "形": 340,
      "影": 341,
      "彼": 342,
      "往": 343,
      "征": 344,
      "径": 345,
      "得": 346,
      "循": 347,
      "心": 348,
      "必": 349,
      "态": 350,
      "性": 351,
      "息": 352,
      "悬": 353,
      "情": 354,
      "意": 355,
      "憩": 356,
      "成": 357,
      "或": 358,
      "户": 359,
      "房": 360,
      "所": 361,
      "扇": 362,
      "手": 363,
      "才": 364,
      "扑": 365,
      "打": 366,
      "扩": 367,
      "扰": 368,
      "承": 369,
      "折": 370,
      "抬": 371,
      "抵": 372,
      "拉": 373,
      "拐": 374,
      "拓": 375,
      "拟": 376,
      "拥": 377,
      "括": 378,
      "拱": 379,
      "拼": 380,
      "持": 381,
      "指": 382,
      "按": 383,
      "挡": 384,
      "挨": 385,
      "换": 386,
      "据": 387,
      "捷": 388,
      "排": 389,
      "接": 390,
      "推": 391,
      "描": 392,
      "提": 393,
      "插": 394,
      "搭": 395,
      "撑": 396,
      "支": 397,
      "放": 398,
      "故": 399,
      "效": 400,
      "散": 401,
      "数": 402,
      "整": 403,
      "斜": 404,
      "断": 405,
      "方": 406,
      "施": 407,
      "旁": 408,
      "无": 409,
      "既": 410,
      "日": 411,
      "时": 412,
      "明": 413,
      "是": 414,
      "显": 415,
      "普": 416,
      "景": 417,
      "晰": 418,
      "暗": 419,
      "更": 420,
      "替": 421,
      "最": 422,
      "有": 423,
      "服": 424,
      "望": 425,
      "朝": 426,
      "木": 427,
      "未": 428,
      "末": 429,
      "本": 430,
      "机": 431,
      "杂": 432,
      "束": 433,
      "条": 434,
      "来": 435,
      "构": 436,
      "枢": 437,
      "架": 438,
      "某": 439,
      "柜": 440,
      "柱": 441,
      "标": 442,
      "栋": 443,
      "样": 444,
      "核": 445,
      "根": 446,
      "格": 447,
      "框": 448,
      "桌": 449,
      "梯": 450,
      "椅": 451,
      "楼": 452,
      "模": 453,
      "横": 454,
      "橙": 455,
      "橱": 456,
      "次": 457,
      "止": 458,
      "正": 459,
      "此": 460,
      "步": 461,
      "死": 462,
      "段": 463,
      "每": 464,
      "毗": 465,
      "水": 466,
      "求": 467,
      "汇": 468,
      "池": 469,
      "沙": 470,
      "沟": 471,
      "没": 472,
      "沿": 473,
      "法": 474,
      "注": 475,
      "洗": 476,
      "洞": 477,
      "活": 478,
      "流": 479,
      "浅": 480,
      "测": 481,
      "浴": 482,
      "淋": 483,
      "淡": 484,
      "深": 485,
      "混": 486,
      "清": 487,
      "渡": 488,
      "滑": 489,
      "满": 490,
      "潜": 491,
      "灰": 492,
      "点": 493,
      "烹": 494,
      "然": 495,
      "照": 496,
      "片": 497,
      "物": 498,
      "特": 499,
      "状": 500,
      "独": 501,
      "狭": 502,
      "玄": 503,
      "环": 504,
      "现": 505,
      "玻": 506,
      "理": 507,
      "璃": 508,
      "生": 509,
      "用": 510,
      "田": 511,
      "由": 512,
      "画": 513,
      "畅": 514,
      "界": 515,
      "留": 516,
      "略": 517,
      "疏": 518,
      "白": 519,
      "的": 520,
      "皆": 521,
      "盖": 522,
      "盥": 523,
      "目": 524,
      "直": 525,
      "相": 526,
      "盾": 527,
      "看": 528,
      "眠": 529,
      "着": 530,
      "睡": 531,
      "矛": 532,
      "知": 533,
      "矩": 534,
      "短": 535,
      "础": 536,
      "确": 537,
      "碍": 538,
      "示": 539,
      "离": 540,
      "私": 541,
      "种": 542,
      "积": 543,
      "称": 544,
      "移": 545,
      "程": 546,
      "稍": 547,
      "稳": 548,
      "空": 549,
      "穿": 550,
      "窄": 551,
      "窗": 552,
      "立": 553,
      "竖": 554,
      "童": 555,
      "端": 556,
      "符": 557,
      "第": 558,
      "等": 559,
      "筑": 560,
      "签": 561,
      "箭": 562,
      "簇": 563,
      "簧": 564,
      "类": 565,
      "粉": 566,
      "糊": 567,
      "系": 568,
      "素": 569,
      "紧": 570,
      "紫": 571,
      "红": 572,
      "约": 573,
      "级": 574,
      "纵": 575,
      "纽": 576,
      "线": 577,
      "组": 578,
      "织": 579,
      "终": 580,
      "经": 581,
      "结": 582,
      "绕": 583,
      "络": 584,
      "统": 585,
      "继": 586,
      "续": 587,
      "维": 588,
      "绿": 589,
      "编": 590,
      "缘": 591,
      "缝": 592,
      "缸": 593,
      "缺": 594,
      "网": 595,
      "置": 596,
      "群": 597,
      "翼": 598,
      "考": 599,
      "者": 600,
      "而": 601,
      "耸": 602,
      "联": 603,
      "聚": 604,
      "背": 605,
      "能": 606,
      "自": 607,
      "至": 608,
      "致": 609,
      "航": 610,
      "良": 611,
      "色": 612,
      "节": 613,
      "范": 614,
      "菜": 615,
      "落": 616,
      "蓝": 617,
      "藏": 618,
      "虚": 619,
      "虽": 620,
      "行": 621,
      "衔": 622,
      "衣": 623,
      "表": 624,
      "被": 625,
      "裹": 626,
      "西": 627,
      "要": 628,
      "覆": 629,
      "见": 630,
      "观": 631,
      "规": 632,
      "视": 633,
      "觉": 634,
      "角": 635,
      "触": 636,
      "言": 637,
      "计": 638,
      "记": 639,
      "设": 640,
      "识": 641,
      "该": 642,
      "语": 643,
      "误": 644,
      "说": 645,
      "调": 646,
      "象": 647,
      "贯": 648,
      "贴": 649,
      "赖": 650,
      "走": 651,
      "起": 652,
      "越": 653,
      "趋": 654,
      "足": 655,
      "距": 656,
      "跨": 657,
      "路": 658,
      "身": 659,
      "车": 660,
      "转": 661,
      "轮": 662,
      "轴": 663,
      "较": 664,
      "辅": 665,
      "辐": 666,
      "辑": 667,
      "辨": 668,
      "边": 669,
      "达": 670,
      "过": 671,
      "近": 672,
      "还": 673,
      "这": 674,
      "进": 675,
      "远": 676,
      "连": 677,
      "述": 678,
      "透": 679,
      "逐": 680,
      "递": 681,
      "途": 682,
      "通": 683,
      "逻": 684,
      "道": 685,
      "遥": 686,
      "遮": 687,
      "遵": 688,
      "那": 689,
      "邻": 690,
      "部": 691,
      "都": 692,
      "配": 693,
      "里": 694,
      "重": 695,
      "针": 696,
      "铺": 697,
      "链": 698,
      "错": 699,
      "键": 700,
      "镜": 701,
      "长": 702,
      "门": 703,
      "闭": 704,
      "间": 705,
      "阁": 706,
      "阔": 707,
      "阳": 708,
      "阶": 709,
      "阻": 710,
      "附": 711,
      "际": 712,
      "限": 713,
      "院": 714,
      "除": 715,
      "隐": 716,
      "隔": 717,
      "隙": 718,
      "集": 719,
      "需": 720,
      "静": 721,
      "非": 722,
      "靠": 723,
      "面": 724,
      "顶": 725,
      "顺": 726,
      "须": 727,
      "预": 728,
      "题": 729,
      "颜": 730,
      "额": 731,
      "飘": 732,
      "餐": 733,
      "饪": 734,
      "首": 735,
      "驳": 736,
      "高": 737,
      "黄": 738,
      "黑": 739,
      "齐": 740,
      "卧室": 741,
      "走廊": 742,
      "浴室": 743,
      "客厅": 744,
      "厨房": 745,
      "位于": 746,
      "相邻": 747,
      "连接": 748,
      "右侧": 749,
      "下方": 750,
      "上方": 751,
      "间卧室": 752,
      "通过": 753,
      "个卧室": 754,
      "左侧": 755,
      "相连": 756,
      "另一": 757,
      "连通": 758,
      "厨房位于": 759,
      "与走廊": 760,
      "房间": 761,
      "南侧": 762,
      "北侧": 763,
      "区域": 764,
      "分别": 765,
      "直接": 766,
      "通过走廊": 767,
      "与客厅": 768,
      "紧邻": 769,
      "东侧": 770,
      "卫生": 771,
      "卫生间": 772,
      "客厅位于": 773,
      "中部": 774,
      "与厨房": 775,
      "分别位于": 776,
      "其中": 777,
      "间浴室": 778,
      "西侧": 779,
      "右下": 780,
      "一个": 781,
      "布局": 782,
      "浴室相邻": 783,
      "右上": 784,
      "左上": 785,
      "卧室相邻": 786,
      "一间卧室": 787,
      "左下": 788,
      "两个卧室": 789,
      "中央": 790,
      "两个": 791,
      "房屋": 792,
      "分布": 793,
      "另一间卧室": 794,
      "卧室位于": 795,
      "整体": 796,
      "的卧室": 797,
      "位置": 798,
      "虚线": 799,
      "与走廊相邻": 800,
      "东南": 801,
      "一个卧室": 802,
      "所有": 803,
      "右下角": 804,
      "浴室和": 805,
      "整体布局": 806,
      "卧室与": 807,
      "两间卧室": 808,
      "卧室和": 809,
      "浴室位于": 810,
      "与客厅相邻": 811,
      "通过虚线": 812,
      "形成": 813,
      "左下角": 814,
      "之间": 815,
      "其右侧": 816,
      "右上角": 817,
      "所有房间": 818,
      "空间": 819,
      "贯穿": 820,
      "西南": 821,
      "左上角": 822,
      "直接相邻": 823,
      "另一个卧室": 824,
      "两个浴室": 825,
      "厨房在": 826,
      "一间浴室": 827,
      "各房间": 828,
      "东北": 829,
      "中间": 830,
      "与厨房相邻": 831,
      "三间卧室": 832,
      "占据": 833,
      "西北": 834,
      "并与": 835,
      "间接": 836,
      "中心": 837,
      "与走廊相连": 838,
      "直接连通": 839,
      "其上方": 840,
      "餐厅": 841,
      "居中": 842,
      "客厅占据": 843,
      "客厅在": 844,
      "底部": 845,
      "靠近": 846,
      "通过走廊与": 847,
      "与浴室相邻": 848,
      "三个卧室": 849,
      "依次": 850,
      "实现": 851,
      "连接厨房": 852,
      "其他": 853,
      "贯穿中部": 854,
      "两间浴室": 855,
      "同时": 856,
      "相接": 857,
      "关系": 858,
      "该卧室": 859,
      "直接相连": 860,
      "结构": 861,
      "两个卧室分别位于": 862,
      "个房间": 863,
      "中部偏": 864,
      "上下": 865,
      "边界": 866,
      "为客厅": 867,
      "另一个": 868,
      "功能": 869,
      "厨房和": 870,
      "连接客厅": 871,
      "紧邻走廊": 872,
      "为浴室": 873,
      "右上方": 874,
      "通过走廊或": 875,
      "卧室在": 876,
      "与卧室相邻": 877,
      "一个浴室": 878,
      "与卧室": 879,
      "为卧室": 880,
      "厨房位于左侧": 881,
      "右下方": 882,
      "延伸": 883,
      "东南侧": 884,
      "中央偏": 885,
      "浴室在": 886,
      "走廊相邻": 887,
      "下方是": 888,
      "书房": 889,
      "东南角": 890,
      "两侧": 891,
      "左下方": 892,
      "过道": 893,
      "通过一": 894,
      "有一间卧室": 895,
      "紧邻客厅": 896,
      "相通": 897,
      "走廊位于": 898,
      "两个浴室分别位于": 899,
      "处于": 900,
      "通道": 901,
      "的浴室": 902,
      "邻接": 903,
      "分布在": 904,
      "与浴室": 905,
      "起居": 906,
      "其左侧": 907,
      "西南侧": 908,
      "与走廊和": 909,
      "为走廊": 910,
      "西北侧": 911,
      "居中偏": 912,
      "其北侧": 913,
      "独立": 914,
      "两个卫生间": 915,
      "整体布局中": 916,
      "相互": 917,
      "西南角": 918,
      "另一间浴室": 919,
      "紧邻厨房": 920,
      "整体布局呈": 921,
      "中间偏": 922,
      "通过虚线连接": 923,
      "左上方": 924,
      "与客厅相连": 925,
      "与右侧": 926,
      "方向": 927,
      "并与之": 928,
      "与上方": 929,
      "间接连通": 930,
      "走廊连接": 931,
      "部分": 932,
      "走廊贯穿中部": 933,
      "与客厅和": 934,
      "通过走廊连接": 935,
      "卧室及": 936,
      "其他房间": 937,
      "与厨房和": 938,
      "上方是": 939,
      "下方连接": 940,
      "正下方": 941,
      "为厨房": 942,
      "客厅和": 943,
      "东北侧": 944,
      "紧邻浴室": 945,
      "客厅相邻": 946,
      "东北角": 947,
      "多个房间": 948,
      "该浴室": 949,
      "西北角": 950,
      "起居室": 951,
      "客厅右侧": 952,
      "与一间卧室": 953,
      "表示": 954,
      "与下方": 955,
      "底部中央": 956,
      "第二": 957,
      "核心": 958,
      "实现连通": 959,
      "其下方": 960,
      "两间浴室分别位于": 961,
      "厨房位于房屋": 962,
      "走廊相连": 963,
      "排列": 964,
      "分布于": 965,
      "共享": 966,
      "通向": 967,
      "次卧": 968,
      "卫生间相邻": 969,
      "卧室和浴室": 970,
      "横向": 971,
      "走廊为": 972,
      "两者": 973,
      "上部": 974,
      "第三间卧室": 975,
      "彼此": 976,
      "和右下": 977,
      "其东侧": 978,
      "左右": 979,
      "色区域": 980,
      "走廊右侧": 981,
      "有一": 982,
      "纵向": 983,
      "与左侧": 984,
      "厨房相邻": 985,
      "通过一条": 986,
      "厨房右侧": 987,
      "和浴室": 988,
      "右侧卧室": 989,
      "走廊的": 990,
      "客厅的": 991,
      "相互连通": 992,
      "连接走廊": 993,
      "其南侧": 994,
      "紧凑": 995,
      "走廊向": 996,
      "),": 997,
      "主卧室": 998,
      "中间卧室": 999,
      "客厅位于房屋": 1000,
      "功能区": 1001,
      "以走廊为": 1002,
      "另一卧室": 1003,
      "下方卧室": 1004,
      "的卧室相邻": 1005,
      "浴室及": 1006,
      "和右侧": 1007,
      "主卧": 1008,
      "其中一个卧室": 1009,
      "连通关系": 1010,
      "连接着": 1011,
      "厨房与": 1012,
      "与一间卧室相邻": 1013,
      "客厅位于左侧": 1014,
      "两个卧室和": 1015,
      "矩形": 1016,
      "北接": 1017,
      "两间卧室分别位于": 1018,
      "上方卧室": 1019,
      "卧室位于房屋": 1020,
      "连接另一间卧室": 1021,
      "客厅与": 1022,
      "走廊呈": 1023,
      "厨房位于左下角": 1024,
      "正上方": 1025,
      "包含": 1026,
      "客厅下方": 1027,
      "次卧室": 1028,
      "所有房间均": 1029,
      "存在": 1030,
      "客厅居中偏": 1031,
      "与走廊及": 1032,
      "关联": 1033,
      "左侧卧室": 1034,
      "垂直": 1035,
      "浴室相连": 1036,
      "通过走廊相连": 1037,
      "右下卧室": 1038,
      "与走廊直接相连": 1039,
      "连接浴室": 1040,
      "连接卧室": 1041,
      "围绕": 1042,
      "设有": 1043,
      "走廊左侧": 1044,
      "和下方": 1045,
      "走廊上方": 1046,
      "厨房位于左上角": 1047,
      "与另一间卧室": 1048,
      "一间": 1049,
      "紧邻卧室": 1050,
      "下位置": 1051,
      "中心偏": 1052,
      "厨房下方": 1053,
      "路径": 1054,
      "右方": 1055,
      "均通过走廊与": 1056,
      "浴室和卧室": 1057,
      "顶部": 1058,
      "一个卫生间": 1059,
      "有一个卧室": 1060,
      "扇门": 1061,
      "客厅上方": 1062,
      "其西侧": 1063,
      "和右下角": 1064,
      "其上方是": 1065,
      "两个卫生间分别位于": 1066,
      "客厅东侧": 1067,
      "走廊居中": 1068,
      "墙体": 1069,
      "中下": 1070,
      "中间浴室": 1071,
      "连接一间卧室": 1072,
      "客厅北侧": 1073,
      "右上卧室": 1074,
      "均与走廊": 1075,
      "中心位置": 1076,
      "其中左上": 1077,
      "走廊横": 1078,
      "形成一个": 1079,
      "各房间通过走廊": 1080,
      "南北": 1081,
      "卧室与浴室": 1082,
      "和一间浴室": 1083,
      "厨房的": 1084,
      "厨房上方": 1085,
      "二者": 1086,
      "客厅左侧": 1087,
      "以及": 1088,
      "的客厅": 1089,
      "走廊东侧": 1090,
      "绿色": 1091,
      "延伸至": 1092,
      "右上区域": 1093,
      "接走廊": 1094,
      "右侧是": 1095,
      "面积": 1096,
      "厨房及": 1097,
      "左中": 1098,
      "另一个浴室": 1099,
      "分别分布于": 1100,
      "明确": 1101,
      "客厅西侧": 1102,
      "各房间通过": 1103,
      "为另一间卧室": 1104,
      "的浴室相邻": 1105,
      "卧室相连": 1106,
      "与餐厅": 1107,
      "各自": 1108,
      "走廊横贯": 1109,
      "浴室与": 1110,
      "三间卧室分别位于": 1111,
      "较大": 1112,
      "共享边界": 1113,
      "左右两侧": 1114,
      "厨房位于左侧中部": 1115,
      "间接相连": 1116,
      "紧邻一间卧室": 1117,
      "卧室与浴室相邻": 1118,
      "走廊下方": 1119,
      "东南区域": 1120,
      "与卧室和": 1121,
      "通过走廊或直接": 1122,
      "最右侧": 1123,
      "相邻且": 1124,
      "另有一间卧室": 1125,
      "中上": 1126,
      "分布着": 1127,
      "主要": 1128,
      "各功能区": 1129,
      "客厅位于中央偏": 1130,
      "与北侧": 1131,
      "两个卧室及": 1132,
      "通过一扇门": 1133,
      "走廊位于房屋": 1134,
      "中心区域": 1135,
      "枢纽": 1136,
      "南部": 1137,
      "卧室与客厅": 1138,
      "不直接相邻": 1139,
      "卧室则": 1140,
      "与浴室和": 1141,
      "入口": 1142,
      "以走廊为核心": 1143,
      "向东": 1144,
      "三个卧室分别位于": 1145,
      "不相邻": 1146,
      "另一间": 1147,
      "其中一间卧室": 1148,
      "并与之相邻": 1149,
      "右中部": 1150,
      "通过虚线表示": 1151,
      "西邻": 1152,
      "整体呈": 1153,
      "和厨房": 1154,
      "走廊贯穿": 1155,
      "动线": 1156,
      "旁边": 1157,
      "厨房左侧": 1158,
      "通过走廊实现": 1159,
      "大部分": 1160,
      "走廊横贯中部": 1161,
      "卧室分布在": 1162,
      "不同": 1163,
      "多个卧室": 1164,
      "房子": 1165,
      "厨房位于左下方": 1166,
      "卫生间位于": 1167,
      "客厅南侧": 1168,
      "中间偏右": 1169,
      "接厨房": 1170,
      "邻近": 1171,
      "其他区域": 1172,
      "与走廊相接": 1173,
      "左上区域": 1174,
      "左下卧室": 1175,
      "与厨房相连": 1176,
      "作为": 1177,
      "两间": 1178,
      "上位置": 1179,
      "均与走廊相连": 1180,
      "生活": 1181,
      "厨房位于右侧": 1182,
      "卧室之间": 1183,
      "环绕": 1184,
      "居住": 1185,
      "向右": 1186,
      "卧室和厨房": 1187,
      "向南": 1188,
      "客厅位于右侧": 1189,
      "空间连通": 1190,
      "蓝色": 1191,
      "左下区域": 1192,
      "两间卧室及": 1193,
      "另一个卧室位于": 1194,
      "规则": 1195,
      "不规则": 1196,
      "平面": 1197,
      "布局的": 1198,
      "放射": 1199,
      "东西": 1200,
      "直接相通": 1201,
      "卧室与厨房": 1202,
      "的居住": 1203,
      "北部": 1204,
      "走廊西侧": 1205,
      "接壤": 1206,
      "向下": 1207,
      "客厅与厨房": 1208,
      "右中": 1209,
      "走廊连接了": 1210,
      "一条": 1211,
      "第二间卧室": 1212,
      "任何": 1213,
      "则与": 1214,
      "连接多个房间": 1215,
      "厨房位于右下角": 1216,
      "东南方向": 1217,
      "并列": 1218,
      "卧室下方": 1219,
      "分别与": 1220,
      "则位于": 1221,
      "卧室均": 1222,
      "厨房与客厅": 1223,
      "通过走廊间接连通": 1224,
      "走廊北侧": 1225,
      "客厅及": 1226,
      "中央走廊": 1227,
      "且与": 1228,
      "东邻": 1229,
      "浴室和厨房": 1230,
      "分区": 1231,
      "南端": 1232,
      "左侧中部": 1233,
      "厨房位于北侧": 1234,
      "分别分布在": 1235,
      "一个卧室相邻": 1236,
      "左邻": 1237,
      "与一间浴室": 1238,
      "包括": 1239,
      "左位置": 1240,
      "有一间浴室": 1241,
      "并排": 1242,
      "放射状": 1243,
      "其右侧紧邻": 1244,
      "连接厨房和": 1245,
      "生活区": 1246,
      "通过门": 1247,
      "西南和": 1248,
      "走廊南侧": 1249,
      "房屋的": 1250,
      "厨房东侧": 1251,
      "水平": 1252,
      "空间结构": 1253,
      "依次排列": 1254,
      "厨房位于右上角": 1255,
      "三间卧室分别分布于": 1256,
      "中部偏右": 1257,
      "其下方是": 1258,
      "第三个卧室": 1259,
      "下方浴室": 1260,
      "有一个": 1261,
      "走廊居中偏": 1262,
      "卧室位于左侧": 1263,
      "其右侧紧邻走廊": 1264,
      "是浴室": 1265,
      "左中部": 1266,
      "与另一间卧室相邻": 1267,
      "房间相邻": 1268,
      "是卧室": 1269,
      "向上": 1270,
      "无直接": 1271,
      "并连通": 1272,
      "厨房南侧": 1273,
      "厨房位于左上方": 1274,
      "相邻关系": 1275,
      "第二间浴室": 1276,
      "均有": 1277,
      "是客厅": 1278,
      "卧室右侧": 1279,
      "左上和": 1280,
      "和右下区域": 1281,
      "均相邻": 1282,
      "中上部": 1283,
      "卧室的": 1284,
      "表明": 1285,
      "浴室右侧": 1286,
      "走廊与": 1287,
      "并与之直接连通": 1288,
      "四间卧室": 1289,
      "右下区域": 1290,
      "与任何": 1291,
      "下方为": 1292,
      "通过走廊连通": 1293,
      "上层": 1294,
      "接客厅": 1295,
      "最上方": 1296,
      "大部分区域": 1297,
      "且均": 1298,
      "夹在": 1299,
      "厨房位于中央偏": 1300,
      "的布局": 1301,
      "西北和": 1302,
      "最下方": 1303,
      "右侧连接": 1304,
      "走廊及": 1305,
      "正南": 1306,
      "横向贯穿中部": 1307,
      "南连": 1308,
      "各个房间": 1309,
      "右侧浴室": 1310,
      "厨房北侧": 1311,
      "功能分区": 1312,
      "但不": 1313,
      "四个卧室": 1314,
      "通过走廊与客厅": 1315,
      "串联": 1316,
      "是厨房": 1317,
      "同时与": 1318,
      "毗邻": 1319,
      "另一间卧室位于": 1320,
      "重叠": 1321,
      "靠近厨房": 1322,
      "与浴室相连": 1323,
      "走廊和": 1324,
      "中部偏左": 1325,
      "上下排列": 1326,
      "均通过走廊或": 1327,
      "厨房与客厅相邻": 1328,
      "另一浴室": 1329,
      "三个": 1330,
      "厨房紧邻": 1331,
      "两个卧室相邻": 1332,
      "主卧室在": 1333,
      "阳台": 1334,
      "东北和": 1335,
      "两个卧室和一个浴室": 1336,
      "显示": 1337,
      "中下部": 1338,
      "多个": 1339,
      "所有房间通过": 1340,
      "通过虚线连接至": 1341,
      "客厅居中": 1342,
      "右侧为": 1343,
      "浴室分布在": 1344,
      "通过走廊或直接相邻": 1345,
      "右侧的": 1346,
      "左侧浴室": 1347,
      "浴室和客厅": 1348,
      "客厅与卧室": 1349,
      "北侧卧室": 1350,
      "东北区域": 1351,
      "一个在": 1352,
      "下部": 1353,
      "和右上角": 1354,
      "客厅与厨房相邻": 1355,
      "再往": 1356,
      "厨房正下方": 1357,
      "靠近浴室": 1358,
      "连接了": 1359,
      "上下相邻": 1360,
      "清晰": 1361,
      "上方浴室": 1362,
      "通过走廊实现连通": 1363,
      "其他房间连通": 1364,
      "连接所有房间": 1365,
      "接浴室": 1366,
      "虚线连接": 1367,
      "整体布局呈不规则": 1368,
      "各房间之间": 1369,
      "东侧卧室": 1370,
      "的卫生间": 1371,
      "中央区域": 1372,
      "方式": 1373,
      "标注": 1374,
      "右侧与": 1375,
      "标示": 1376,
      "其中西北": 1377,
      "各房间通过走廊相互连通": 1378,
      "了一个": 1379,
      "东南卧室": 1380,
      "其右侧紧邻客厅": 1381,
      "拼接": 1382,
      "南侧卧室": 1383,
      "客厅位于左下方": 1384,
      "南邻": 1385,
      "对称": 1386,
      "住宅": 1387,
      "绿色区域": 1388,
      "通过虚线连接表示": 1389,
      "纵向贯穿中部": 1390,
      "下依次": 1391,
      "内部": 1392,
      "仅与": 1393,
      "的卧室与": 1394,
      "与走廊直接连通": 1395,
      "设有一间卧室": 1396,
      "从左": 1397,
      "上方为": 1398,
      "分隔": 1399,
      "右邻": 1400,
      "整体布局紧凑": 1401,
      "通过走廊与客厅相连": 1402,
      "一个走廊": 1403,
      "北邻": 1404,
      "与走廊直接相邻": 1405,
      "过道相邻": 1406,
      "各有一间卧室": 1407,
      "通过一条短": 1408,
      "西南卧室": 1409,
      "客厅相连": 1410,
      "右侧中部": 1411,
      "至右": 1412,
      "厨房位于西南角": 1413,
      "有一个浴室": 1414,
      "左侧为": 1415,
      "厨房和浴室": 1416,
      "形分布": 1417,
      "和南侧": 1418,
      "客厅处于": 1419,
      "通过走廊或直接边界": 1420,
      "床位于": 1421,
      "客厅位于中心偏": 1422,
      "通行": 1423,
      "厨房西侧": 1424,
      "其余": 1425,
      ")、": 1426,
      "另一个在": 1427,
      "整个": 1428,
      "构成": 1429,
      "共用": 1430,
      "与客厅直接相邻": 1431,
      "形成以走廊为核心": 1432,
      "与客厅和走廊相邻": 1433,
      "四周": 1434,
      "无独立": 1435,
      "卧室位于左上角": 1436,
      "组合": 1437,
      "自上": 1438,
      "东连": 1439,
      "并与其": 1440,
      "通过一条走廊相连": 1441,
      "自上而": 1442,
      "右下角卧室": 1443,
      "组成": 1444,
      "间接连接": 1445,
      "又与": 1446,
      "相对": 1447,
      "另一个卧室在": 1448,
      "东西两侧": 1449,
      "连通客厅": 1450,
      "与客厅及": 1451,
      "各功能": 1452,
      "的客厅相邻": 1453,
      "另一个卧室相邻": 1454,
      "潜在": 1455,
      "其右侧与走廊相邻": 1456,
      "厨房位于上方": 1457,
      "厨房和客厅": 1458,
      "向北": 1459,
      "接卧室": 1460,
      "直接连接": 1461,
      "厨房位于西北角": 1462,
      "两个浴室和": 1463,
      "的浴室和": 1464,
      "走廊横向贯穿中部": 1465,
      "设有一间浴室": 1466,
      "下连": 1467,
      "不与任何": 1468,
      "和卫生间": 1469,
      "厨房位于东南角": 1470,
      "东北方向": 1471,
      "布局包含": 1472,
      "厨房在右上角": 1473,
      "并通过一扇门": 1474,
      "客厅正下方": 1475,
      "平面图": 1476,
      "功能分区明确": 1477,
      "通往": 1478,
      "和卧室": 1479,
      "东部": 1480,
      "大片": 1481,
      "中间区域": 1482,
      "十字": 1483,
      "与卧室相连": 1484,
      "第一间卧室": 1485,
      "衔接": 1486,
      "大面积": 1487,
      "客厅和厨房": 1488,
      "有一间": 1489,
      "卧室南侧": 1490,
      "走廊位于中心位置": 1491,
      "厨房在右下角": 1492,
      "与一间浴室相邻": 1493,
      "仅与走廊相邻": 1494,
      "连接一个卧室": 1495,
      "厨房位于餐厅": 1496,
      "的放射状": 1497,
      "上方的卧室": 1498,
      "其右侧紧邻浴室": 1499,
      "走廊作为": 1500,
      "和东侧": 1501,
      "从左至右": 1502,
      "无直接连通": 1503,
      "连接关系": 1504,
      "其中一个": 1505,
      "通过虚线标示": 1506,
      "均与走廊或": 1507,
      "并连接": 1508,
      "大片区域": 1509,
      "的厨房": 1510,
      "与厨房直接相邻": 1511,
      "厨房位于底部中央": 1512,
      "西侧卧室": 1513,
      "下层": 1514,
      "和一间卧室": 1515,
      "无直接相邻": 1516,
      "通过走廊间接相连": 1517,
      "均与走廊相邻": 1518,
      "对应": 1519,
      "右侧卧室相邻": 1520,
      "实现空间连通": 1521,
      "黄色区域": 1522,
      "依次连接": 1523,
      "浴室分别位于": 1524,
      "西南区域": 1525,
      "红色": 1526,
      "辐射": 1527,
      "下方的卧室": 1528,
      "右下角的卧室": 1529,
      "以矩形": 1530,
      "块状": 1531,
      "通过虚线表示的": 1532,
      "卧室和客厅": 1533,
      "一个客厅": 1534,
      "与走廊和浴室相邻": 1535,
      "示意": 1536,
      "偏右": 1537,
      "靠近走廊": 1538,
      "另一个卫生间": 1539,
      "为核心": 1540,
      "仅通过走廊与": 1541,
      "正北": 1542,
      "形成以": 1543,
      "为卫生间": 1544,
      "右上角的卧室": 1545,
      "接触": 1546,
      "相邻卧室": 1547,
      "客厅位于布局": 1548,
      "绿色卧室": 1549,
      "的连通": 1550,
      "还有一间卧室": 1551,
      "左侧与": 1552,
      "中央偏右": 1553,
      "形成一个紧凑": 1554,
      "隔开": 1555,
      "厨房处于": 1556,
      "左侧卧室与": 1557,
      "客厅位于底部中央": 1558,
      "东北卧室": 1559,
      "同样": 1560,
      "与右侧卧室相邻": 1561,
      "此卧室": 1562,
      "下方与": 1563,
      "中部偏南": 1564,
      "相互连接": 1565,
      "房子的": 1566,
      "右侧的卧室": 1567,
      "下方是客厅": 1568,
      "西连": 1569,
      "门洞": 1570,
      "客厅位于入口": 1571,
      "西侧与": 1572,
      "厨房与浴室": 1573,
      "纵向贯穿": 1574,
      "垂直相邻": 1575,
      "中间偏右位置": 1576,
      "走廊连接着": 1577,
      "厨房位于中心偏": 1578,
      "和右上": 1579,
      "浴室下方": 1580,
      "客厅位于左上角": 1581,
      "和一个浴室": 1582,
      "此外": 1583,
      "客厅位于左上方": 1584,
      "之间有一": 1585,
      "中部偏东": 1586,
      "不直接相连": 1587,
      "一个厨房": 1588,
      "三个卧室分别分布在": 1589,
      "连接一间浴室": 1590,
      "厨房紧邻餐厅": 1591,
      "黄色": 1592,
      "下方卧室相邻": 1593,
      "东侧与": 1594,
      "一个浴室相邻": 1595,
      "东南和": 1596,
      "各区域": 1597,
      "并与走廊相连": 1598,
      "与上方卧室相邻": 1599,
      "与其他房间": 1600,
      "连接上下": 1601,
      "卧室不": 1602,
      "虚线表示": 1603,
      "蓝色区域": 1604,
      "该卫生间": 1605,
      "与客厅相接": 1606,
      "依次为": 1607,
      "走廊向上": 1608,
      "右侧为客厅": 1609,
      "三个卧室分别位于左上": 1610,
      "的空间结构": 1611,
      "右侧浴室相邻": 1612,
      "卫生间处于": 1613,
      "矩形区域": 1614,
      "和右下方": 1615,
      "多房间": 1616,
      "卧室北侧": 1617,
      "厨房位于西北侧": 1618,
      "靠近客厅": 1619,
      "其中左上卧室": 1620,
      "客厅右上方": 1621,
      "厨房位于左上区域": 1622,
      "客厅占据右侧": 1623,
      "下方浴室相邻": 1624,
      "左上卧室": 1625,
      "右端": 1626,
      "下方则": 1627,
      "主卧室位于": 1628,
      "最南端": 1629,
      "餐厅东侧": 1630,
      "客厅位于左下角": 1631,
      "其中两个卧室": 1632,
      "其中一间": 1633,
      "左侧的卧室": 1634,
      "其他功能区": 1635,
      "则处于": 1636,
      "分别连接": 1637,
      "通过一条走廊": 1638,
      "与上方卧室": 1639,
      "与厨房和走廊相邻": 1640,
      "形成连通": 1641,
      "紧邻一个卧室": 1642,
      "中部偏北": 1643,
      "上方是客厅": 1644,
      "并与之相连": 1645,
      "该空间": 1646,
      "下方的": 1647,
      "厨房正上方": 1648,
      "走廊两侧": 1649,
      "客厅右下方": 1650,
      "是另一个卧室": 1651,
      "厨房位于东北角": 1652,
      "依次排列着": 1653,
      "与之": 1654,
      "浴室的": 1655,
      "”,": 1656,
      "与东侧": 1657,
      "北端": 1658,
      "空间关联": 1659,
      "另有一间浴室": 1660,
      "浴室处于": 1661,
      "其右侧紧邻厨房": 1662,
      "中间浴室相邻": 1663,
      "卧室和厨房之间": 1664,
      "东端": 1665,
      "与厨房及": 1666,
      "两个浴室及": 1667,
      "中部偏西": 1668,
      "且连通": 1669,
      "两间浴室及": 1670,
      "各有一个卧室": 1671,
      "右上角卧室": 1672,
      "均不": 1673,
      "还有一个卧室": 1674,
      "和走廊": 1675,
      "是餐厅": 1676,
      "其中左上角": 1677,
      "另一个位于": 1678,
      "起居空间": 1679,
      "客厅正": 1680,
      "客厅位于左侧中部": 1681,
      "其他区域连通": 1682,
      "最大": 1683,
      "所有主要": 1684,
      "独立于": 1685,
      "彼此相邻": 1686,
      "顶部中央": 1687,
      "客厅位于入口右侧": 1688,
      "客厅正上方": 1689,
      "右上和": 1690,
      "第四间卧室": 1691,
      "卧室上方": 1692,
      "厨房相连": 1693,
      "中间偏下位置": 1694,
      "条状": 1695,
      "直接或": 1696,
      "浴室和走廊": 1697,
      "厨房位于西南侧": 1698,
      "一个位于": 1699,
      "是卫生间": 1700,
      "是走廊": 1701,
      "走廊右上方": 1702,
      "相邻浴室": 1703,
      "中间偏左": 1704,
      "与下方卧室相邻": 1705,
      "左下角和右下角": 1706,
      "中部偏下": 1707,
      "三间卧室分别位于左上": 1708,
      "客厅与卧室相邻": 1709,
      "南侧与": 1710,
      "两间卧室和一间浴室": 1711,
      "通向客厅": 1712,
      "和东南角": 1713,
      "浴室上方": 1714,
      "下方是浴室": 1715,
      "均通过虚线": 1716,
      "连接另一个卧室": 1717,
      "的布局结构": 1718,
      "走廊右下方": 1719,
      "右侧与客厅相邻": 1720,
      "整体布局呈现": 1721,
      "对面": 1722,
      ");": 1723,
      "北接走廊": 1724,
      "均通过走廊连接": 1725,
      "上方卧室与": 1726,
      "形成以走廊为": 1727,
      "右侧则": 1728,
      "三间浴室": 1729,
      "北侧与": 1730,
      "该卧室下方": 1731,
      "仅与走廊相连": 1732,
      "物理": 1733,
      "直接邻接": 1734,
      "客厅位于中心位置": 1735,
      "下方连接走廊": 1736,
      "它们": 1737,
      "实线": 1738,
      "式布局": 1739,
      "其上方是卧室": 1740,
      "的卧室位于": 1741,
      "另一间卧室及": 1742,
      "后方": 1743,
      "连接另一间浴室": 1744,
      "一个卧室位于": 1745,
      "各房间通过走廊实现连通": 1746,
      "右连": 1747,
      "客厅占据右上区域": 1748,
      "均与": 1749,
      "开放": 1750,
      "斜向": 1751,
      "上方是卧室": 1752,
      "右上和右下": 1753,
      "相邻或": 1754,
      "客厅北侧是餐厅": 1755,
      "和左下角": 1756,
      "该卧室右侧": 1757,
      "形成紧凑": 1758,
      "南北两侧": 1759,
      "紫色": 1760,
      "视觉": 1761,
      "该图": 1762,
      "长条状": 1763,
      "通过虚线示意": 1764,
      "客厅占据东南区域": 1765,
      "非对称": 1766,
      "连接左侧": 1767,
      "走廊连接了厨房": 1768,
      "浴室则": 1769,
      "与客厅直接相连": 1770,
      "走廊向北": 1771,
      "其中一个卧室位于": 1772,
      "连通厨房": 1773,
      "所有房间通过走廊或直接边界": 1774,
      " 卧室": 1775,
      "和上方": 1776,
      "两个卧室之间": 1777,
      "右上角和右下角": 1778,
      "三者": 1779,
      "红色区域": 1780,
      "边缘": 1781,
      "卫生间相连": 1782,
      "分布的": 1783,
      "其他空间": 1784,
      "客厅房间": 1785,
      "右上和右下区域": 1786,
      "该卧室上方": 1787,
      "客厅居中偏下": 1788,
      "自上而下依次": 1789,
      "卧室与客厅相邻": 1790,
      "依次分布着": 1791,
      "向西": 1792,
      "有两个": 1793,
      "走廊或": 1794,
      "走廊连接客厅": 1795,
      "公共": 1796,
      "相邻房间": 1797,
      "蓝色浴室": 1798,
      "的放射状布局": 1799,
      "其中两个卧室分别位于": 1800,
      "两间卧室相邻": 1801,
      "该卧室的": 1802,
      "和客厅": 1803,
      "和右中部": 1804,
      "仅与走廊和": 1805,
      "紧邻另一间卧室": 1806,
      "的浴室相连": 1807,
      "上方是浴室": 1808,
      "水平相邻": 1809,
      "区域相邻": 1810,
      " 相邻": 1811,
      "独立浴室": 1812,
      "无重叠": 1813,
      "另一卧室相邻": 1814,
      "第二个": 1815,
      "走廊向右": 1816,
      "对齐": 1817,
      "有两个卧室": 1818,
      "厨房位于东南侧": 1819,
      "紧邻一间浴室": 1820,
      "部分重叠": 1821,
      "以矩形块状": 1822,
      "走廊正下方": 1823,
      "下方中央": 1824,
      "西南方向": 1825,
      "上接": 1826,
      "和底部中央": 1827,
      "连接北侧": 1828,
      "厨房位于南侧": 1829,
      "与左侧卧室": 1830,
      "主卧位于": 1831,
      "北向南": 1832,
      "南侧为": 1833,
      "的卧室相连": 1834,
      "形成连通关系": 1835,
      "其中一间卧室位于": 1836,
      "走廊居中偏右": 1837,
      "的走廊": 1838,
      "其他房间相连": 1839,
      "均与走廊直接连通": 1840,
      "不同区域": 1841,
      "卧室东侧": 1842,
      "客厅在餐厅": 1843,
      "三个卧室和": 1844,
      "另外": 1845,
      "是另一间卧室": 1846,
      "一个浴室和": 1847,
      "另一间浴室相邻": 1848,
      "阶梯": 1849,
      "左下角卧室": 1850,
      "所有房间通过走廊或直接相邻": 1851,
      "北侧并与之直接连通": 1852,
      "所有卧室均": 1853,
      "卧室和走廊": 1854,
      "封闭": 1855,
      "并与走廊": 1856,
      "东侧为": 1857,
      "两间卧室之间": 1858,
      "通过虚线相连": 1859,
      "厨房在左下角": 1860,
      "西北区域": 1861,
      "一条走廊": 1862,
      "与一个卧室相邻": 1863,
      "由走廊": 1864,
      "走廊纵向贯穿中部": 1865,
      "上方浴室相邻": 1866,
      "和两间浴室": 1867,
      "西边": 1868,
      "西向东": 1869,
      "通过走廊相互连通": 1870,
      "延伸连接": 1871,
      "一间在": 1872,
      "部分房间": 1873,
      "其中左上卧室与": 1874,
      "上至": 1875,
      "中央偏下位置": 1876,
      "中间卧室相邻": 1877,
      "并与走廊相邻": 1878,
      "并通过": 1879,
      "与餐厅相连": 1880,
      "左方": 1881,
      "床铺": 1882,
      "西端": 1883,
      "左侧为浴室": 1884,
      "独立卧室": 1885,
      "下方连接浴室": 1886,
      "中右": 1887,
      "介于": 1888,
      "另设": 1889,
      "南面": 1890,
      "次卧室在": 1891,
      "厨房居中偏": 1892,
      "各房间通过走廊或": 1893,
      "另有一": 1894,
      "核心通道": 1895,
      "彼此不直接相连": 1896,
      "整个布局": 1897,
      "与客厅相通": 1898,
      "左下和": 1899,
      "无独立封闭": 1900,
      "布置": 1901,
      "门相通": 1902,
      "通过走廊与厨房": 1903,
      "其上方为": 1904,
      "通过走廊连接至": 1905,
      "另一间在": 1906,
      "自北向南": 1907,
      "左右相邻": 1908,
      "及下方": 1909,
      "厨房与卧室相邻": 1910,
      "所有房间通过虚线表示的": 1911,
      "与厨房相邻且": 1912,
      "过渡": 1913,
      "浴室位于房屋": 1914,
      "通过一扇": 1915,
      "与左侧卧室相邻": 1916,
      "联系": 1917,
      "还有一个": 1918,
      "厨房房间": 1919,
      "实现空间": 1920,
      "起居区": 1921,
      "较大区域": 1922,
      "走廊相接": 1923,
      "中间偏左位置": 1924,
      "走廊贯穿南北": 1925,
      "厨房紧邻餐厅左侧": 1926,
      "北连": 1927,
      "均位于": 1928,
      "右侧连接另一间卧室": 1929,
      "另一个卧室相连": 1930,
      "底部卧室": 1931,
      "下方是走廊": 1932,
      "且功能分区明确": 1933,
      "彼此相邻且": 1934,
      "形成一个紧凑的居住": 1935,
      "共同": 1936,
      "上方与": 1937,
      "客厅位于西北侧": 1938,
      "客厅与餐厅": 1939,
      "浴室房间": 1940,
      "上方为卧室": 1941,
      "其右侧紧邻卧室": 1942,
      "厨房在客厅西侧": 1943,
      "通道相连": 1944,
      "所有房间均通过走廊实现": 1945,
      "两个浴室相邻": 1946,
      "直接或间接": 1947,
      "上方为客厅": 1948,
      "左上角和右下角": 1949,
      "下方连接另一间卧室": 1950,
      "两者通过一条走廊相连": 1951,
      "的方式": 1952,
      "走廊位于中心区域": 1953,
      "通道相互连通": 1954,
      "客厅占据右侧大部分区域": 1955,
      "和另一间卧室": 1956,
      "客厅与走廊": 1957,
      "厨房和走廊": 1958,
      "均通过走廊与其他房间连通": 1959,
      "另一间位于": 1960,
      "竖直": 1961,
      "左下和右下": 1962,
      "完整": 1963,
      "右上及": 1964,
      "另一间卧室在": 1965,
      "所有房间通过走廊或": 1966,
      "个房间和": 1967,
      "形状": 1968,
      "形贯穿中部": 1969,
      "厨房与浴室相邻": 1970,
      "形成了一个": 1971,
      "间接关联": 1972,
      "延伸出": 1973,
      "邻接关系": 1974,
      "两个卧室和两个浴室": 1975,
      " 浴室": 1976,
      "南接": 1977,
      "浴室直接相邻": 1978,
      "浴室与卧室": 1979,
      "客厅位于西南侧": 1980,
      "其中一个卧室相邻": 1981,
      "垂直排列": 1982,
      "两间卫生间": 1983,
      "边线": 1984,
      "中部偏上": 1985,
      "厨房和卧室": 1986,
      "较大的": 1987,
      "但不直接连通": 1988,
      "仅与客厅相邻": 1989,
      "及浴室": 1990,
      "浴室与厨房": 1991,
      "客厅与走廊相邻": 1992,
      "厨房位于布局": 1993,
      "右下卧室相邻": 1994,
      "形成围绕": 1995,
      "其上方为浴室": 1996,
      "第二个卧室": 1997,
      "其上方是浴室": 1998,
      "其正": 1999,
      "隔墙": 2000,
      "靠近卧室": 2001,
      "起居室相邻": 2002,
      "自西向东": 2003,
      "右侧相邻": 2004,
      "上方和下方": 2005,
      "其中一": 2006,
      "两个卧室分别位于左上和": 2007,
      "下方是另一个卧室": 2008,
      "其上方是走廊": 2009,
      "连接一间卧室和一间浴室": 2010,
      "上侧": 2011,
      "与次卧": 2012,
      "和东南侧": 2013,
      "网络": 2014,
      "卧室与厨房相邻": 2015,
      "整体布局清晰": 2016,
      "其左侧与一间卧室相邻": 2017,
      "中间偏下": 2018,
      "三个卧室分布在": 2019,
      "卧室位于房屋西侧": 2020,
      "与另一间卧室相连": 2021,
      "床的": 2022,
      "连接餐厅": 2023,
      "连接各个房间": 2024,
      "连通结构": 2025,
      "客厅位于上方": 2026,
      "整体布局以走廊为核心": 2027,
      "西北方向": 2028,
      "为一间卧室": 2029,
      "走廊同时": 2030,
      "其右侧为走廊": 2031,
      "与走廊和卧室相邻": 2032,
      "连通路径": 2033,
      "上方是另一个卧室": 2034,
      "且不": 2035,
      "互通": 2036,
      "厨房与卧室": 2037,
      "左侧为卧室": 2038,
      "客厅位于北侧": 2039,
      "右上卧室与": 2040,
      "且与客厅": 2041,
      "再向右": 2042,
      "环形": 2043,
      "右侧与走廊相邻": 2044,
      "之间有": 2045,
      "所有房间均通过": 2046,
      "仅与客厅和": 2047,
      "一间卧室相邻": 2048,
      "整体布局呈十字": 2049,
      "其正下方": 2050,
      "依次为卧室": 2051,
      "上下两": 2052,
      "方向上": 2053,
      "走廊呈纵向贯穿中部": 2054,
      "与中间": 2055,
      "是一个": 2056,
      "贯通": 2057,
      "右侧为走廊": 2058,
      "客厅位于东南侧": 2059,
      "客厅位于中心区域": 2060,
      "西侧与客厅相邻": 2061,
      "浴室位于右侧": 2062,
      "与走廊和客厅相邻": 2063,
      "起居室位于": 2064,
      "该图显示": 2065,
      "底层": 2066,
      "右侧与厨房相邻": 2067,
      "上方卧室相邻": 2068,
      "整体布局的": 2069,
      "上方是走廊": 2070,
      "床相邻": 2071,
      "客厅为核心": 2072,
      "区域包含": 2073,
      "紧邻一个浴室": 2074,
      "左下角的卧室": 2075,
      "走廊向西": 2076,
      "并与客厅": 2077,
      "连接两个卧室": 2078,
      "左侧和右侧": 2079,
      "浴室和另一间卧室": 2080,
      "独立卫生间": 2081,
      "右下卧室则": 2082,
      "阶梯状": 2083,
      "东接": 2084,
      "以中央": 2085,
      "并通过走廊与": 2086,
      "玄关": 2087,
      "厨房紧邻客厅": 2088,
      "右侧卧室及": 2089,
      "下方为浴室": 2090,
      "北接客厅": 2091,
      "客厅居中偏上": 2092,
      "的居住空间结构": 2093,
      "最东侧": 2094,
      "北侧为": 2095,
      "通过虚线与": 2096,
      "通过一条短走廊相连": 2097,
      "上的": 2098,
      "东边": 2099,
      "及厨房": 2100,
      "及右侧": 2101,
      "卧室西侧": 2102,
      "走廊在": 2103,
      "左侧与一间卧室相邻": 2104,
      "另一间卧室相邻": 2105,
      "客厅东侧并与之直接连通": 2106,
      "整体布局呈不规则形状": 2107,
      "中左": 2108,
      "所有房间通过走廊实现": 2109,
      "厨房位于房屋西侧": 2110,
      "与卧室和走廊相邻": 2111,
      "客厅与卧室通过走廊相连": 2112,
      "卫生间东侧": 2113,
      "客厅位于右下角": 2114,
      "其上方为卧室": 2115,
      "客厅在左下角": 2116,
      "书房位于": 2117,
      "上部中央": 2118,
      "两个卧室和一个卫生间": 2119,
      "一面": 2120,
      "以虚线": 2121,
      "形环绕": 2122,
      "走廊正上方": 2123,
      "下方是卧室": 2124,
      "所有主要房间": 2125,
      "与卫生间相邻": 2126,
      "并通向": 2127,
      "相望": 2128,
      "东南部": 2129,
      "各房间通过虚线标示": 2130,
      "左中和": 2131,
      "再往右": 2132,
      "浴室东侧": 2133,
      "客厅居中偏南": 2134,
      "为餐厅": 2135,
      "并延伸至": 2136,
      "上方为浴室": 2137,
      "分布两间卧室": 2138,
      "三个卧室分别分布于": 2139,
      "其中西北卧室": 2140,
      "尽头": 2141,
      "次卧室和厨房之间": 2142,
      "连接卫生间": 2143,
      "通过走廊与厨房相连": 2144,
      "客厅位于下方": 2145,
      "通过门洞": 2146,
      "并通过走廊连接": 2147,
      "浴室与客厅": 2148,
      "邻接走廊": 2149,
      "通过走廊间接": 2150,
      "并直接连通": 2151,
      "或走廊": 2152,
      "进入": 2153,
      "卧室位于北侧": 2154,
      "走廊呈横向": 2155,
      "客厅居中偏右": 2156,
      "上邻": 2157,
      "西侧为": 2158,
      "一个客厅和": 2159,
      "与客厅相邻且": 2160,
      "三间卧室分别分布在": 2161,
      "通过门相连": 2162,
      "客厅位于中央": 2163,
      "左上角卧室": 2164,
      "另一个浴室相邻": 2165,
      "与浴室和走廊相邻": 2166,
      "拼接结构": 2167,
      "分散": 2168,
      "夹于": 2169,
      "并通过虚线连接": 2170,
      "下方为客厅": 2171,
      "走廊居中连接": 2172,
      "各功能房间": 2173,
      "与多个房间": 2174,
      "中央走廊连接": 2175,
      "北接厨房": 2176,
      "大部分空间": 2177,
      "表明存在": 2178,
      "一面墙": 2179,
      "南接走廊": 2180,
      "堆叠": 2181,
      "紫色区域": 2182,
      "卧室位于左下角": 2183,
      "卧室位于西南侧": 2184,
      "左上角和右上角": 2185,
      "其上方紧邻客厅": 2186,
      "两间卧室及一间浴室": 2187,
      "主卧室在客厅正": 2188,
      "且两者": 2189,
      "四个": 2190,
      "均通过": 2191,
      "次卧室相邻": 2192,
      "其他空间连通": 2193,
      "通过走廊连接客厅": 2194,
      "与南侧": 2195,
      "上方和右侧": 2196,
      "右上部": 2197,
      "下侧": 2198,
      "的客厅和": 2199,
      "卧室分别位于": 2200,
      "右侧连接客厅": 2201,
      "与客厅或": 2202,
      "东侧为客厅": 2203,
      "其中一个浴室": 2204,
      "客厅占据右下": 2205,
      "三间卧室分别分布于左上": 2206,
      "左端": 2207,
      "或功能": 2208,
      "的房间": 2209,
      "厨房位于东侧": 2210,
      "客厅位于南侧": 2211,
      "厨房在东南角": 2212,
      "各房间通过走廊相连": 2213,
      "各房间通过虚线连接表示": 2214,
      "该卧室左侧": 2215,
      "次卧室在主卧室": 2216,
      " 与": 2217,
      "隔走廊": 2218,
      "上方连接": 2219,
      "厨房位于东北侧": 2220,
      "分别与两者": 2221,
      "长条状贯穿中部": 2222,
      "右侧卧室与": 2223,
      "一个厨房和": 2224,
      "走廊位于中央": 2225,
      "厨房位于房屋南侧": 2226,
      "另有一个卧室": 2227,
      "的连通关系": 2228,
      "直线": 2229,
      "两个卧室相连": 2230,
      "标记": 2231,
      "分别靠近": 2232,
      "左下卧室与": 2233,
      "其右侧为": 2234,
      "三个卧室分布于": 2235,
      "中上和": 2236,
      "它们之间": 2237,
      "上至下依次": 2238,
      "主卧室与": 2239,
      "此浴室": 2240,
      "东侧则": 2241,
      "次卧室之间": 2242,
      "右侧是客厅": 2243,
      "厨房位于餐厅北侧并与之直接连通": 2244,
      "以矩形块状分布": 2245,
      "该布局包含": 2246,
      "通过走廊间接连接": 2247,
      "房屋北侧": 2248,
      "其上方是客厅": 2249,
      "无直接相邻房间": 2250,
      "开放式": 2251,
      "和底部": 2252,
      "走廊尽头": 2253,
      "其右侧与客厅相邻": 2254,
      "厨房在东北角": 2255,
      "中间位置": 2256,
      "三间卧室及": 2257,
      "邻接厨房": 2258,
      "厨房位于上方中央": 2259,
      "并与厨房": 2260,
      "或通道": 2261,
      "卧室与走廊": 2262,
      "客厅与浴室": 2263,
      "客厅位于右上角": 2264,
      "与浴室相邻且": 2265,
      "客厅和浴室": 2266,
      "自上而下": 2267,
      "该空间由": 2268,
      "东面": 2269,
      "方位": 2270,
      "右侧紧邻客厅": 2271,
      "一个卫生间相邻": 2272,
      "浴室位于左侧": 2273,
      "客厅占据右上": 2274,
      "中间偏上": 2275,
      "中间偏上位置": 2276,
      "与厨房和浴室相邻": 2277,
      "个房间和一个走廊": 2278,
      "右侧为卧室": 2279,
      "厨房位于西侧": 2280,
      "直接边界": 2281,
      "空间布局": 2282,
      "其下方紧邻走廊": 2283,
      "与左侧卧室和": 2284,
      "各功能空间": 2285,
      "一侧": 2286,
      "与西侧": 2287,
      "浴室紧邻": 2288,
      "厨房位于中心位置": 2289,
      "客厅位于左下区域": 2290,
      "其上方紧邻走廊": 2291,
      "三间卧室分别分布于西北": 2292,
      "门相连": 2293,
      "右侧连接厨房": 2294,
      "左侧为客厅": 2295,
      "房屋布局": 2296,
      "与右侧卧室": 2297,
      "三间卧室分别位于西北": 2298,
      "其他区域相连": 2299,
      "单元": 2300,
      "推拉": 2301,
      "右侧为浴室": 2302,
      "厨房在左上角": 2303,
      "与客厅和浴室相邻": 2304,
      "之间有一条": 2305,
      "可达": 2306,
      "走廊分布": 2307,
      "厨房右上方": 2308,
      "南侧连接": 2309,
      "客厅居中偏北": 2310,
      "厨房位于走廊": 2311,
      "与走廊连通": 2312,
      "西侧连接": 2313,
      "客厅在右侧": 2314,
      "卧室及浴室": 2315,
      "三间": 2316,
      "依次是": 2317,
      "该卧室东侧": 2318,
      "客厅和卧室": 2319,
      "其南侧紧邻走廊": 2320,
      "其中一个卧室与浴室相邻": 2321,
      "通行路径": 2322,
      "——": 2323,
      "处在": 2324,
      "客厅区域": 2325,
      "连通的": 2326,
      "其上方为走廊": 2327,
      "主卧室和": 2328,
      "下方卧室与": 2329,
      "其中一间浴室": 2330,
      "上下两侧": 2331,
      "与下方卧室": 2332,
      "上方的": 2333,
      "卫生间及": 2334,
      "卧室位于右侧": 2335,
      "所有房间围绕": 2336,
      "客厅在右上角": 2337,
      "形成一个完整": 2338,
      "通过一条短走廊": 2339,
      "实线边界": 2340,
      "东接走廊": 2341,
      "厨房与走廊相邻": 2342,
      "紧邻卫生间": 2343,
      "依次相邻": 2344,
      "中央偏下": 2345,
      "邻接浴室": 2346,
      "与右侧的卧室相邻": 2347,
      "客厅位于中央偏上位置": 2348,
      "客厅同时": 2349,
      "厨房位于左上": 2350,
      "房屋中部": 2351,
      "浴室和两个卧室": 2352,
      "之间由": 2353,
      "各房间通过走廊或直接相邻": 2354,
      "东北部": 2355,
      "间接或": 2356,
      "客厅占据房屋": 2357,
      "或客厅": 2358,
      "设置": 2359,
      "左侧浴室相邻": 2360,
      "客厅位于左上区域": 2361,
      "其中左下卧室": 2362,
      "走廊向南": 2363,
      "形成一个整体": 2364,
      "多个卧室和浴室": 2365,
      "其余房间": 2366,
      "走廊向右延伸": 2367,
      "南侧为客厅": 2368,
      "其北侧与走廊相邻": 2369,
      "其中一个卧室在": 2370,
      "均通过走廊与其他区域连通": 2371,
      "较大面积": 2372,
      "客厅位于中央偏左": 2373,
      "的居住空间": 2374,
      "走廊居中偏下": 2375,
      "下邻": 2376,
      "与一个卧室": 2377,
      "向左": 2378,
      "四个房间": 2379,
      "分别连通": 2380,
      "的卧室则": 2381,
      "东南卧室则": 2382,
      "功能空间": 2383,
      "厨房和卧室之间": 2384,
      "第一间浴室": 2385,
      "位于左侧": 2386,
      "右侧为厨房": 2387,
      "南侧的": 2388,
      "另一间卧室相连": 2389,
      "卧室位于西北侧": 2390,
      "与走廊和厨房相邻": 2391,
      "两卧室": 2392,
      "附近": 2393,
      "卧室处于": 2394,
      "连接卧室和浴室": 2395,
      "与厨房相接": 2396,
      "其中上方卧室": 2397,
      "另一个浴室位于": 2398,
      "以走廊为中心": 2399,
      "走廊向上延伸": 2400,
      "矩形区域组成": 2401,
      "该图显示了一个": 2402,
      "通过通道": 2403,
      "三间卧室和两间浴室": 2404,
      "下方连接着": 2405,
      "厨房位于房屋北侧": 2406,
      "三个卧室分别分布在左上": 2407,
      "的东侧": 2408,
      "右侧与走廊相连": 2409,
      "下方连接厨房": 2410,
      "厨房在客厅": 2411,
      "通过走廊或通道": 2412,
      ";“": 2413,
      "不直接": 2414,
      "与过道": 2415,
      "的右侧": 2416,
      "卧室房间": 2417,
      "浴室均": 2418,
      "厨房右下方": 2419,
      "紧邻主卧室": 2420,
      "其右侧为浴室": 2421,
      "厨房在西南角": 2422,
      "客厅占据右下区域": 2423,
      "卧室位于房屋西南侧": 2424,
      "通过走廊或直接墙体": 2425,
      "串联起": 2426,
      "上接厨房": 2427,
      "与两个卧室相邻": 2428,
      "被走廊": 2429,
      "北侧浴室": 2430,
      "东侧的": 2431,
      "卧室位于东南侧": 2432,
      "与上方的卧室": 2433,
      "通过走廊连接其他房间": 2434,
      "围绕其": 2435,
      "正南方": 2436,
      "多个位置": 2437,
      "且通过一条走廊": 2438,
      "划分": 2439,
      "西接走廊": 2440,
      "整体形成": 2441,
      "该浴室又": 2442,
      "厨房位于房屋西北侧": 2443,
      "走廊呈竖直": 2444,
      "与北侧卧室": 2445,
      "向下连接": 2446,
      "大面积区域": 2447,
      "与卫生间": 2448,
      "且与厨房": 2449,
      "并与客厅相邻": 2450,
      "厨房位于客厅右侧": 2451,
      "客厅位于左下": 2452,
      "其中左侧卧室": 2453,
      "依次分布": 2454,
      "与厨房和走廊相连": 2455,
      "厨房位于房屋西南侧": 2456,
      "连接了多个房间": 2457,
      "两间卫生间分别位于": 2458,
      "交叉": 2459,
      "末端": 2460,
      "西接": 2461,
      "下方为卧室": 2462,
      "卫生间则": 2463,
      "卫生间则处于": 2464,
      "与走廊相邻且": 2465,
      "左下角和右上角": 2466,
      "中央偏上位置": 2467,
      "有一条": 2468,
      "各自邻近": 2469,
      "为另一个卧室": 2470,
      "为另一卧室": 2471,
      "偏左": 2472,
      "右边": 2473,
      "浴室左侧": 2474,
      "客厅为": 2475,
      "占据了": 2476,
      "厨房和卫生间": 2477,
      "两者通过一扇": 2478,
      "卧室位于房屋东侧": 2479,
      "旁边是浴室": 2480,
      "三个卧室和两个浴室": 2481,
      "浴室与厨房相邻": 2482,
      "所有房间均通过走廊实现连通": 2483,
      "存在连通关系": 2484,
      "展示": 2485,
      "连续": 2486,
      "浴室居中偏": 2487,
      "与走廊相通": 2488,
      "通过走廊连接厨房": 2489,
      "其中左侧": 2490,
      "西侧则": 2491,
      "右上卧室相邻": 2492,
      "房屋西侧": 2493,
      "直接相邻或": 2494,
      "通过走廊与其他房间连通": 2495,
      "下方连接一间卧室": 2496,
      "面积最大": 2497,
      "不同位置": 2498,
      "走廊作为中心": 2499,
      "无直接连通房间": 2500,
      "多间卧室": 2501,
      "与走廊直接相通": 2502,
      "区域由": 2503,
      "两个卧室分别": 2504,
      "其右侧紧邻一个卧室": 2505,
      "主卧室在客厅正后方": 2506,
      "没有": 2507,
      "的西侧": 2508,
      "西部": 2509,
      "客厅位于东侧": 2510,
      "所有房间通过虚线表示": 2511,
      "各房间通过虚线表示": 2512,
      "上下分布": 2513,
      "纵向排列": 2514,
      "与卧室和浴室相邻": 2515,
      "与卧室和走廊相连": 2516,
      " 过道": 2517,
      "及卫生间": 2518,
      "和西侧": 2519,
      "均与卧室": 2520,
      "的连接": 2521,
      "右侧卧室位于": 2522,
      "右侧与浴室相邻": 2523,
      "右侧和下方": 2524,
      "左侧连接": 2525,
      "厨房位于客厅": 2526,
      "客厅位于西侧": 2527,
      "其中客厅": 2528,
      "底部浴室": 2529,
      "中央偏左": 2530,
      "面积较大": 2531,
      ",“": 2532,
      "形布局": 2533,
      "连接左侧卧室": 2534,
      "左侧的": 2535,
      "厨房位于左下": 2536,
      "一个浴室位于": 2537,
      "通过虚线连通": 2538,
      "三间卧室分布于": 2539,
      "客厅占据东北区域": 2540,
      "彼此不直接相邻": 2541,
      "且与之": 2542,
      "交错": 2543,
      "左连": 2544,
      "的位置": 2545,
      "卧室左侧": 2546,
      "走廊处于": 2547,
      "浴室与卧室相邻": 2548,
      "客厅位于布局的": 2549,
      "直接连通关系": 2550,
      "依次连通": 2551,
      "下方是厨房": 2552,
      "横向贯穿": 2553,
      "走廊向东": 2554,
      "客厅位于中央偏上": 2555,
      "形成以走廊为核心的放射状布局": 2556,
      "右接": 2557,
      "最南侧": 2558,
      "非直接相邻": 2559,
      "右侧连通": 2560,
      "中部区域": 2561,
      "其中厨房": 2562,
      "其中两间": 2563,
      "浴室位于走廊": 2564,
      "与一间卧室相连": 2565,
      "之间有一扇门": 2566,
      "及走廊相邻": 2567,
      "无其他房间": 2568,
      "浴室夹在": 2569,
      "东侧连接": 2570,
      "左上和右下": 2571,
      "中央为客厅": 2572,
      "其下方紧邻客厅": 2573,
